import dayjs from 'dayjs';

function getRandomInt(min, max) {
  min = Math.ceil(min);
  max = Math.floor(max);
  return Math.floor(Math.random() * (max - min)) + min; //Максимум не включается, минимум включается
}

const generateEvents = () => {
  const events = {
    group_1: [
      { id: 1, from: dayjs('2020-01-31T23:30:00.000Z'), to: dayjs('2020-02-01T02:25:00.000Z')},
      { id: 2, from: dayjs('2020-02-01T01:30:00.000Z'), to: dayjs('2020-02-01T03:15:00.000Z')},
      { id: 3, from: dayjs('2020-02-01T03:15:00.000Z'), to: dayjs('2020-02-01T06:00:00.000Z')},
      { id: 4, from: dayjs('2020-02-01T03:15:00.000Z'), to: dayjs('2020-02-01T06:00:00.000Z')},
      { id: 9, from: dayjs('2020-02-01T08:00:00.000Z'), to: dayjs('2020-02-01T10:30:00.000Z')},
      { id: 20, from: dayjs('2020-02-02T06:00:00.000Z'), to: dayjs('2020-02-02T08:30:00.000Z')},
      { id: 21, from: dayjs('2020-02-02T06:15:00.000Z'), to: dayjs('2020-02-02T09:10:00.000Z')},
      { id: 31, from: dayjs('2020-02-03T08:00:00.000Z'), to: dayjs('2020-02-03T11:00:00.000Z')},
      { id: 34, from: dayjs('2020-02-04T07:30:00.000Z'), to: dayjs('2020-02-04T14:00:00.000Z')},

    ],
    group_2: [
      { id: 15, from: dayjs('2020-02-01T13:25:00.000Z'), to: dayjs('2020-02-01T15:25:00.000Z')},
      { id: 16, from: dayjs('2020-02-01T14:20:00.000Z'), to: dayjs('2020-02-01T17:05:00.000Z')},
      { id: 17, from: dayjs('2020-02-01T16:25:00.000Z'), to: dayjs('2020-02-01T19:10:00.000Z')},
      { id: 18, from: dayjs('2020-02-01T17:00:00.000Z'), to: dayjs('2020-02-01T21:59:00.000Z')},
      { id: 19, from: dayjs('2020-02-01T17:00:00.000Z'), to: dayjs('2020-02-01T21:59:00.000Z')},
      { id: 24, from: dayjs('2020-02-02T08:00:00.000Z'), to: dayjs('2020-02-02T11:00:00.000Z')},
      { id: 25, from: dayjs('2020-02-02T09:50:00.000Z'), to: dayjs('2020-02-02T12:50:00.000Z')},
      { id: 26, from: dayjs('2020-02-02T10:00:00.000Z'), to: dayjs('2020-02-02T12:30:00.000Z')},
      { id: 32, from: dayjs('2020-02-03T17:00:00.000Z'), to: dayjs('2020-02-03T21:59:00.000Z')},
      { id: 35, from: dayjs('2020-02-04T08:00:00.000Z'), to: dayjs('2020-02-04T11:00:00.000Z')},
    ],
    group_3: [
      { id: 10, from: dayjs('2020-02-01T08:30:00.000Z'), to: dayjs('2020-02-01T11:00:00.000Z')},
      { id: 11, from: dayjs('2020-02-01T09:15:00.000Z'), to: dayjs('2020-02-01T13:55:00.000Z')},
      { id: 12, from: dayjs('2020-02-01T09:30:00.000Z'), to: dayjs('2020-02-01T12:00:00.000Z')},
      { id: 13, from: dayjs('2020-02-01T11:30:00.000Z'), to: dayjs('2020-02-01T13:45:00.000Z')},
      { id: 14, from: dayjs('2020-02-01T11:35:00.000Z'), to: dayjs('2020-02-01T13:50:00.000Z')},
      { id: 29, from: dayjs('2020-02-02T12:25:00.000Z'), to: dayjs('2020-02-02T14:35:00.000Z')},
      { id: 30, from: dayjs('2020-02-02T14:00:00.000Z'), to: dayjs('2020-02-02T16:00:00.000Z')},
      { id: 33, from: dayjs('2020-02-03T17:00:00.000Z'), to: dayjs('2020-02-03T21:59:00.000Z')},
      { id: 22, from: dayjs('2020-02-02T06:20:00.000Z'), to: dayjs('2020-02-02T09:20:00.000Z')},
      { id: 23, from: dayjs('2020-02-02T06:30:00.000Z'), to: dayjs('2020-02-02T08:30:00.000Z')},
    ],
    group_4: [
      { id: 5, from: dayjs('2020-02-01T04:35:00.000Z'), to: dayjs('2020-02-01T08:45:00.000Z')},
      { id: 6, from: dayjs('2020-02-01T05:50:00.000Z'), to: dayjs('2020-02-01T08:20:00.000Z')},
      { id: 7, from: dayjs('2020-02-01T07:30:00.000Z'), to: dayjs('2020-02-01T10:30:00.000Z')},
      { id: 8, from: dayjs('2020-02-01T07:30:00.000Z'), to: dayjs('2020-02-01T10:00:00.000Z')},
      { id: 27, from: dayjs('2020-02-02T10:25:00.000Z'), to: dayjs('2020-02-02T12:50:00.000Z')},
      { id: 28, from: dayjs('2020-02-02T11:20:00.000Z'), to: dayjs('2020-02-02T13:50:00.000Z')},
      { id: 36, from: dayjs('2020-02-04T08:50:00.000Z'), to: dayjs('2020-02-04T11:15:00.000Z')},
    ]

  }
  return events;
}

export const events = generateEvents();